# Configuration Notebook

In [163]:
# import des libraries
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt
plt.style.use('fivethirtyeight')
plt.rcParams["figure.figsize"] = (8, 6)
import matplotlib.dates as mdates
import seaborn as sns
import pandas as pd
import scipy as sp
from urllib import request
import scipy.stats as st

# Importation et préparation des données

### Données customers

In [164]:
clients = pd.read_csv("customers.csv")

In [165]:
clients.head(5)

  client_id sex  birth
0    c_4410   f   1967
1    c_7839   f   1975
2    c_1699   f   1984
3    c_5961   f   1962
4    c_5320   m   1943

### Visualisation tendances centrales

In [166]:
clients.describe()

             birth
count  8623.000000
mean   1978.280877
std      16.919535
min    1929.000000
25%    1966.000000
50%    1979.000000
75%    1992.000000
max    2004.000000

In [167]:
clients['client_id'].value_counts()

c_5521    1
c_918     1
c_2652    1
c_2094    1
c_6977    1
         ..
c_7096    1
c_1514    1
c_2144    1
c_4453    1
c_4919    1
Name: client_id, Length: 8623, dtype: int64

### Recherche des valeurs manquantes

In [168]:
clients.isnull().values.any()

False

In [169]:
clients.isna().values.any()

False

#### Il n'y a pas de valeurs manquantes ou null

### Recherche client_id anormales

In [170]:
clients.sort_values(['client_id'], axis=0, ascending=False, inplace=True)
clients.head(5)

     client_id sex  birth
8494      ct_1   m   2001
2735      ct_0   f   2001
7358     c_999   m   1964
2145     c_998   m   2001
94       c_997   f   1994

#### 2 clients de tests ressortent : ct_1 & ct_0

### Suppression des 2 clients de test ct_

In [171]:
clients = clients.set_index("client_id")
clients = clients.drop("ct_1", axis=0)
clients = clients.drop("ct_0", axis=0)

### Recherhe client_id anormales - verrification

In [172]:
clients.sort_values(['client_id'], axis=0, ascending=False, inplace=True)
clients.head(5)

          sex  birth
client_id
c_999       m   1964
c_998       m   2001
c_997       f   1994
c_996       f   1970
c_995       m   1955

#### Les 2 ct_ n'y sont plus

### Vérification colonne 'SEX'

In [173]:
pd.crosstab(index = clients["sex"], columns="count")

col_0  count
sex
f       4490
m       4131

#### Pas d'anomalie présente dans la colonne 'SEX'

### Indexation Clients

In [174]:
clients = clients.reset_index()

### Données Products

In [175]:
produits = pd.read_csv("products.csv")

In [176]:
produits.head(5)

  id_prod  price  categ
0  0_1421  19.99      0
1  0_1368   5.13      0
2   0_731  17.99      0
3   1_587   4.99      1
4  0_1507   3.99      0

### Exploration des données

In [177]:
produits.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3287 entries, 0 to 3286
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id_prod  3287 non-null   object
 1   price    3287 non-null   float64
 2   categ    3287 non-null   int64
dtypes: float64(1), int64(1), object(1)
memory usage: 77.2+ KB

### Recherche des valeurs manquantes

In [178]:
produits.isnull().values.any()

False

In [179]:
produits.isna().values.any()

False

#### Il n'y a pas de valeurs manquantes ou null

### Recherche id_prod aberrantes

In [180]:
produits.sort_values(["id_prod"], axis=0, ascending=False, inplace=True)
produits.head(5)

     id_prod   price  categ
731      T_0   -1.00      0
3188    2_99   84.99      2
3088    2_98  149.74      2
2698    2_97  160.99      2
2576    2_96   47.91      2

#### T_0 est certainement un produit de test, à supprimer

### Suppression produit T_O

In [181]:
produits = produits.set_index("id_prod")
produits = produits.drop("T_0", axis=0)
produits.sort_values(["id_prod"], axis=0, ascending=False, inplace=True)
produits.head(5)

          price  categ
id_prod
2_99      84.99      2
2_98     149.74      2
2_97     160.99      2
2_96      47.91      2
2_95      98.99      2

#### T_0 correctement supprimé

### Exploration tendances centrales

In [182]:
produits.describe()

             price        categ
count  3286.000000  3286.000000
mean     21.863597     0.370359
std      29.849786     0.615446
min       0.620000     0.000000
25%       6.990000     0.000000
50%      13.075000     0.000000
75%      22.990000     1.000000
max     300.000000     2.000000

### Indexation Produits

In [183]:
produits = produits.reset_index()

### Données Transactions

In [184]:
ventes = pd.read_csv("transactions.csv")
ventes.head(5)

  id_prod                        date session_id client_id
0  0_1483  2021-04-10 18:37:28.723910    s_18746    c_4450
1   2_226  2022-02-03 01:55:53.276402   s_159142     c_277
2   1_374  2021-09-23 15:13:46.938559    s_94290    c_4270
3  0_2186  2021-10-17 03:27:18.783634   s_105936    c_4597
4  0_1351  2021-07-17 20:34:25.800563    s_63642    c_1242

In [185]:
## Les id_prod T_0 et donc les client_id ct_0 & ct_1 sont présent, il faut donc les supprimer

In [186]:
ventes.sort_values(['id_prod'], axis=0, ascending=False, inplace=True)
ventes.head(5)

       id_prod                             date session_id client_id
210294     T_0  test_2021-03-01 02:30:02.237432        s_0      ct_0
75176      T_0  test_2021-03-01 02:30:02.237443        s_0      ct_1
203418     T_0  test_2021-03-01 02:30:02.237449        s_0      ct_0
259192     T_0  test_2021-03-01 02:30:02.237444        s_0      ct_0
234706     T_0  test_2021-03-01 02:30:02.237441        s_0      ct_1

#### Suppression ct_

In [187]:
ventes = ventes.set_index("client_id")
ventes = ventes.drop("ct_1", axis=0)
ventes = ventes.drop("ct_0", axis=0)

#### Exploration des données

In [188]:
ventes.info()
ventes.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 336816 entries, c_5828 to c_853
Data columns (total 3 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     336816 non-null  object
 1   date        336816 non-null  object
 2   session_id  336816 non-null  object
dtypes: object(3)
memory usage: 10.3+ MB

       id_prod                        date session_id
count   336816                      336816     336816
unique    3265                      336816     169194
top      1_369  2021-06-13 21:03:59.031927   s_118668
freq      1081                           1         14

#### Pas de valeurs nulles

In [189]:
ventes.head(5)

          id_prod                        date session_id
client_id
c_5828       2_99  2021-11-21 01:53:46.967570   s_122697
c_7135       2_99  2021-07-11 20:56:49.820935    s_61009
c_5967       2_98  2021-03-08 21:10:32.250919     s_3637
c_5899       2_97  2021-04-06 19:09:32.897796    s_16930
c_2989       2_97  2022-01-31 09:37:00.283109   s_157815

### Recherche de données manquantes ou abberantes

In [190]:
ventes.isnull().values.any()

False

In [191]:
ventes.isna().values.any()

False

#### Il n'y a pas de valeurs manquantes ou nulles

### Recherche "id_prod" manquants ou aberrants

In [192]:
list_produits = produits['id_prod'].unique()
produits_err = []

In [193]:
def check_id_prod(id_prod):
    if id_prod not in list_produits:
        produits_err.append(id_prod)
    return id_prod

ventes['id_prod'] = ventes['id_prod'].apply(check_id_prod)

def unique(prod_err): 
    x = np.array(produits_err) 
    print(np.unique(x))
    
unique(produits_err)

['0_2245']

#### "id_prod" -> 0_2245 est inconnu
#### Imputation 0_2245  -> moyenne categ 0

In [194]:
produits.loc[produits['id_prod']=="0_2245"]

Empty DataFrame
Columns: [id_prod, price, categ]
Index: []

In [195]:
ventes.loc[ventes['id_prod']=="0_2245"].head(5)

          id_prod                        date session_id
client_id
c_4113     0_2245  2021-11-19 03:46:40.122185   s_121796
c_8616     0_2245  2021-09-25 17:07:45.271509    s_95396
c_6952     0_2245  2021-07-10 11:54:44.891532    s_60426
c_1189     0_2245  2021-03-07 20:00:01.525768     s_3159
c_1657     0_2245  2021-05-21 08:09:31.636364    s_37437

### Calcul de la moyenne des prix de la categ 0

In [196]:
moy_categ_0 = round(np.mean(produits.price[produits.categ == 0]), 1)
print("La moyenne des prix de la categorie 0 est de :",moy_categ_0)

La moyenne des prix de la categorie 0 est de : 11.7

### Imputation du prix moyen de la catégorie 0 au produit 0_2245

In [197]:
produits = produits.append({'id_prod' : '0_2245', 'price' : moy_categ_0 , 'categ' : 0}, ignore_index=True)

In [198]:
produits.loc[produits['id_prod']=="0_2245"]

     id_prod  price  categ
3286  0_2245   11.7      0

### Recherche "client_id" aberrants

In [199]:
ventes = ventes.reset_index()

list_clients = clients['client_id'].unique()
clients_err = []

def check_id_client(client_id):
    if client_id not in list_clients:
        clients_err.append(client_id)
    return client_id

ventes['client_id'] = ventes['client_id'].apply(check_id_client)

def unique(clients_err): 
    x = np.array(clients_err) 
    print(np.unique(x))
    
unique(clients_err)

[]

#### Aucun code client inconnu

### Correctif du format date

In [200]:
ventes['date'] = pd.to_datetime(ventes['date'])

In [201]:
ventes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 336816 entries, 0 to 336815
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   client_id   336816 non-null  object
 1   id_prod     336816 non-null  object
 2   date        336816 non-null  datetime64[ns]
 3   session_id  336816 non-null  object
dtypes: datetime64[ns](1), object(3)
memory usage: 10.3+ MB

#### Le type de DATE est bien changé en datetime

In [202]:
ventes.head(5)

  client_id id_prod                       date session_id
0    c_5828    2_99 2021-11-21 01:53:46.967570   s_122697
1    c_7135    2_99 2021-07-11 20:56:49.820935    s_61009
2    c_5967    2_98 2021-03-08 21:10:32.250919     s_3637
3    c_5899    2_97 2021-04-06 19:09:32.897796    s_16930
4    c_2989    2_97 2022-01-31 09:37:00.283109   s_157815

### Exportations des 3 DataFrame Produits/Clients/Ventes

In [203]:
produits.to_csv('produits.csv', index=False)
clients.to_csv('clients.csv', index=False)
ventes.to_csv('ventes.csv', index=False)

# Suite -> P4_02_scriptanalyse